Revit 2024 API
IFCData.AsString Method
 Gets storage value as string when its PrimitiveType is string, binary or enumeration.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public string AsString()
Visual Basic
Public Function AsString As String
Visual C++
public:
String^ AsString()
Return Value
 The string value.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InapplicableDataException |  The primitive type is not string, binary or enumeration.
See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace